Revit 2024 API
GroupTypeId.AnalyticalModel Property
 Analytical Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId AnalyticalModel { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModel As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModel {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace